## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]
* Replace
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;jd-bureau&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;jd-reply-jury-summons&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-video-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;jd-bureau&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;jd-reply-jury-summons&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["jd-bureau"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-juror-bureau-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-bureau/endpoints/hmcts-juror-bureau-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-juror-bureau-shutter-prod" -> "hmcts-jd-bureau-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["jd-reply-jury-summons"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-reply-jury-summons-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-reply-jury-summons/endpoints/hmcts-reply-jury-summons-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-reply-jury-summons-shutter-prod" -> "hmcts-jd-reply-jury-summons-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-vh-admin-web-shutter-prod"
      + origin_host_header            = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-vh-admin-web"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsvhadminwshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-video-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-video-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-video-shutter-prod" -> "hmcts-vh-video-web-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["jd-bureau"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-bureau/endpoints/hmcts-juror-bureau-shutter-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-bureau/endpoints/hmcts-juror-bureau-shutter-prod/customDomains/juror-bureau-justice-gov-uk" -> (known after apply)
        name            = "juror-bureau-justice-gov-uk"
        # (1 unchanged attribute hidden)

      - user_managed_https {
          - key_vault_certificate_id = "https://acmedtssdsprod.vault.azure.net/certificates/juror-bureau-justice-gov-uk" -> null
          - key_vault_secret_id      = "https://acmedtssdsprod.vault.azure.net/secrets/juror-bureau-justice-gov-uk" -> null
          - tls_version              = "None" -> null
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["jd-reply-jury-summons"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-reply-jury-summons/endpoints/hmcts-reply-jury-summons-shutter-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-jd-reply-jury-summons/endpoints/hmcts-reply-jury-summons-shutter-prod/customDomains/reply-jury-summons-service-gov-uk" -> (known after apply)
        name            = "reply-jury-summons-service-gov-uk"
        # (1 unchanged attribute hidden)

      - user_managed_https {
          - key_vault_certificate_id = "https://acmedtssdsprod.vault.azure.net/certificates/reply-jury-summons-service-gov-uk" -> null
          - key_vault_secret_id      = "https://acmedtssdsprod.vault.azure.net/secrets/reply-jury-summons-service-gov-uk" -> null
          - tls_version              = "None" -> null
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "admin.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "admin-hearings-reform-hmcts-net"
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "video.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "video-hearings-reform-hmcts-net"
    }

Plan: 8 to add, 0 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":449,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->